print("-"*15, "Task 1", "-"*15)
print("Реалізувати одновимірний масив, довжину масива та сам масив користувач має ввести з клавіатури. Виконати над масивом обчислення, вказані  у Вашому варіанті")
print("Дано одномірний масив, що складається з N дійсних елементів. Масив користувач має ввести з клавіатури. Знайти максимальний від’ємний елемент.")

n = int(input("value of arrays elements:"))
print(f"Enter {n} array elements:")

arr = [int(input()) for _ in range(n)]
print("Original array: ", arr)
negative_elements = [element for element in arr if element < 0]
print(negative_elements)
print (min (negative_elements))


print("-"*15, "Task 2", "-"*15)
print("Заповнити двовимірний масив розміром 7x7 таким чином, як показано на рисунку згідно з Вашим варіантом. Вивести масив на екран. Для виконання завдання використовуйте цикли.")
N2 = 7
a = [[j-i for j in range(N2)] for i in range(N2)]
for row in a:
    print(*row)

print("-"*15, "Task 3", "-"*15)
print("Реалізувати функцію, яка виконує операції над списками – задану за варіантом та друк списку на екран. Список користувач має вводити з клавіатури.")
print("Доповнення списку у кінці елементами списку з парними індексами.")

