print("-"*15, "Task 1", "-"*15)
print("Реалізувати одновимірний масив, довжину масива та сам масив користувач має ввести з клавіатури. Виконати над масивом обчислення, вказані  у Вашому варіанті")
print("Дано одномірний масив, що складається з N дійсних елементів. Масив користувач має ввести з клавіатури. Знайти максимальний від’ємний елемент.")

n = int(input("value of arrays elements:"))
print(f"Enter {n} array elements:")

arr = [int(input()) for _ in range(n)]
print("Original array: ", arr)
negative_elements = [element for element in arr if element < 0]
print(negative_elements)
print (min (negative_elements))


print("-"*15, "Task 2", "-"*15)
print("Заповнити двовимірний масив розміром 7x7 таким чином, як показано на рисунку згідно з Вашим варіантом. Вивести масив на екран. Для виконання завдання використовуйте цикли.")
N2 = 7
a = [[j-i for j in range(N2)] for i in range(N2)]
for row in a:
    print(*row)

print("-"*15, "Task 3", "-"*15)
print("Реалізувати функцію, яка виконує операції над списками – задану за варіантом та друк списку на екран. Список користувач має вводити з клавіатури.")
print("Доповнення списку у кінці елементами списку з парними індексами.")

list_input = input("Введіть елементи через побіл: ")
list = list_input.split(' ')
second_list = []
print(list)
i = 0
while i < len(list) :
    if i%2 == 0:
        print(list[i])
        second_list.append(list[i])
    i += 1
final_list = list + second_list
print("Кінцевий список: ".format(final_list))


print("-"*15, "Task 4", "-"*15)
print("Реалізувати функцію, яка виконує операції над списками – задану за варіантом та друк списку на екран.")
print("Формування нового списку, у який входять елементи, що повторюються у попередньому списку.")
list2_input = input("Введіть елементи через побіл: ")
list2 = list2_input.split(' ')
second2_list = []
print(list2)
i = 1
while i < len(list2) :
    if list2[] == list2[i-1]:
        print(list2[i])
        second2_list.append(list2[i])
    i += 1
final2_list = list2 + second2_list
print("Кінцевий список: ".format(final2_list))


print("-"*15, "Task 5", "-"*15)
print(" Реалізувати функцію, яка виконує операції над множинами – задану за варіантом та друк множини на екран. У випадку, якщо задану варіантом операцію над множиною виконати не можна, перетворіть множину у список, а потім при виведенні на екран результуючий список перетворіть на множину.")
print("Маємо три множини x, y, z цифр {8,9,10,11, …, 21,22}. Змінній х присвоїти множину всіх цілих чисел від 8 до 22, змінній у – множину всіх простих чисел з цього діапазону")



