import pandas as pd

#Завдання 1

StudentsMark = {
    "Кравченко Юлія Володимирівна": [3, 4, 5, 6, 7],
    "Оніщенко Максим Ігоревич": [12, 12, 12, 12, 12],
    "Барненко Ліза Вікторівна": [12, 12, 12, 10, 11],
    "Михайленко Ірина Анатоліївна": [12, 10, 8, 9, 2],
    "Ярмоленко Валентина Соломонівна": [10, 4, 5, 7, 8],
    "Барщук Аліса Марківна": [12, 12, 3, 4, 12],
    "Щербань Дарія Миколаївна": [10, 10, 9, 8, 7],
    "Ведмідь Юрій Ігоревич": [12, 5, 6, 8, 2],
    "Якубович Олег Миколайович": [10, 3, 9, 8, 7],
    "Ведмідь Ірина Василівна": [12, 5, 9, 2, 2],
}

print(StudentsMark)

#Перетворення на DataFram
df = pd.DataFrame.from_dict(StudentsMark, orient='index')
df.columns = ['Оцінка 1', 'Оцінка 2', 'Оцінка 3', 'Оцінка 4', 'Оцінка 5']

#Базовий аналіз даних
print(df.head(3))
print(df.dtypes)
print(df.shape)
print(df.describe())

#Додавання нового стовпця
df['Середній бал'] = df.mean(axis=1)

#Фільтрація даних
best_students = df[df['Середній бал'] > 9]
print(best_students)

#Сортування даних
df_sorted = df.sort_values(by='Середній бал', ascending=False) #Сортування за середнім балом за спаданням(ascending=False)
print(df_sorted)

#Групування даних
df['Факультет'] = ['КН', 'ПМ', 'КН', 'ПМ', 'КН', 'ПМ', 'ПМ', 'КН', 'КН', 'ПМ'] #Додаємо новий рядок
avarage_faculty = df.groupby('Факультет').mean()  #середній бал по факультетах
print(avarage_faculty)

#Додаткові операції агрегації
print(df.groupby('Факультет')['Середній бал'].max()) #максимальний середній бал на кожному факультеті
print(df['Факультет'].value_counts()) #кількість студентів на кожному факультеті

